it-tests/src/test/resources/warhome/toolkitx/testkit/tests/PnrXop/Xop/body.txt

--MIMEBoundary_95b57d7287e4fa4b528a8f050c41f8ad829c20332f23b48d
Content-Type: application/xop+xml; charset=UTF-8; type="application/soap+xml"
Content-Transfer-Encoding: binary
Content-ID: <0.85b57d7287e4fa4b528a8f050c41f8ad829c20332f23b48d@apache.org>

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
    <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:To soapenv:mustUnderstand="true">http://localhost:8000/sim/bill__rr/rep/prb</wsa:To>
        <wsa:MessageID soapenv:mustUnderstand="true"
            >urn:uuid:A51311F0AFB3EBCF891467743286288</wsa:MessageID>
        <wsa:Action soapenv:mustUnderstand="true"
            >urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</wsa:Action>
    </soapenv:Header>
    <soapenv:Body>
        <xdsb:ProvideAndRegisterDocumentSetRequest xmlns:xdsb="urn:ihe:iti:xds-b:2007">
            <lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
                <rim:RegistryObjectList xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
                    <rim:ExtrinsicObject id="Document01"
                        objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1"
                        mimeType="text/plain">
                        <rim:Slot name="creationTime">
                            <rim:ValueList>
                                <rim:Value>20051224</rim:Value>
                            </rim:ValueList>
                        </rim:Slot>
                        <rim:Slot name="languageCode">
                            <rim:ValueList>
                                <rim:Value>en-us</rim:Value>
                            </rim:ValueList>
                        </rim:Slot>
                        <rim:Slot name="serviceStartTime">
                            <rim:ValueList>
                                <rim:Value>200412230800</rim:Value>
                            </rim:ValueList>
                        </rim:Slot>
                        <rim:Slot name="serviceStopTime">
                            <rim:ValueList>
                                <rim:Value>200412230801</rim:Value>
                            </rim:ValueList>
                        </rim:Slot>
                        <rim:Slot name="sourcePatientId">
                            <rim:ValueList>
                                <rim:Value>89765a87b^^^&amp;1.3.4.5&amp;ISO</rim:Value>
                            </rim:ValueList>
                        </rim:Slot>
                        <rim:Slot name="sourcePatientInfo">
                            <rim:ValueList>
                                <rim:Value>PID-3|pid1^^^&amp;1.2.3&amp;ISO</rim:Value>
                                <rim:Value>PID-5|Doe^John^^^</rim:Value>
                                <rim:Value>PID-7|19560527</rim:Value>
                                <rim:Value>PID-8|M</rim:Value>
                                <rim:Value>PID-11|100 Main St^^Metropolis^Il^44130^USA</rim:Value>
                            </rim:ValueList>
                        </rim:Slot>
                        <rim:Name>
                            <rim:LocalizedString value="Physical"/>
                        </rim:Name>
                        <rim:Description/>
                        <rim:Classification classifiedObject="Document01" nodeRepresentation=""
                            classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                            id="id_1">
                            <rim:Slot name="authorPerson">
                                <rim:ValueList>
                                    <rim:Value>^Smitty^Gerald^^^</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Slot name="authorInstitution">
                                <rim:ValueList>
                                    <rim:Value>Cleveland Clinic</rim:Value>
                                    <rim:Value>Parma Community</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Slot name="authorRole">
                                <rim:ValueList>
                                    <rim:Value>Attending</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Slot name="authorSpecialty">
                                <rim:ValueList>
                                    <rim:Value>Orthopedic</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                        </rim:Classification>
                        <rim:Classification classifiedObject="Document01" nodeRepresentation=""
                            classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                            id="id_2">
                            <rim:Slot name="authorPerson">
                                <rim:ValueList>
                                    <rim:Value>^Dopplemeyer^Sherry^^^</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Slot name="authorInstitution">
                                <rim:ValueList>
                                    <rim:Value>Cleveland Clinic</rim:Value>
                                    <rim:Value>Berea Community</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Slot name="authorRole">
                                <rim:ValueList>
                                    <rim:Value>Primary Surgon</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Slot name="authorSpecialty">
                                <rim:ValueList>
                                    <rim:Value>Orthopedic</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                        </rim:Classification>
                        <rim:Classification classifiedObject="Document01"
                            nodeRepresentation="DEMO-Ext Summary"
                            classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                            id="id_3">
                            <rim:Slot name="codingScheme">
                                <rim:ValueList>
                                    <rim:Value>1.3.6.1.4.1.21367.100.1</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Name>
                                <rim:LocalizedString value="Summary for External / Non Clinical Use"/>
                            </rim:Name>
                        </rim:Classification>
                        <rim:Classification classifiedObject="Document01" nodeRepresentation="V"
                            classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                            id="id_4">
                            <rim:Slot name="codingScheme">
                                <rim:ValueList>
                                    <rim:Value>2.16.840.1.113883.5.25</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Name>
                                <rim:LocalizedString value="very restricted"/>
                            </rim:Name>
                        </rim:Classification>
                        <rim:Classification classifiedObject="Document01"
                            nodeRepresentation="urn:ihe:rad:TEXT"
                            classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                            id="id_5">
                            <rim:Slot name="codingScheme">
                                <rim:ValueList>
                                    <rim:Value>1.3.6.1.4.1.19376.1.2.3</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Name>
                                <rim:LocalizedString value="urn:ihe:rad:TEXT"/>
                            </rim:Name>
                        </rim:Classification>
                        <rim:Classification classifiedObject="Document01"
                            nodeRepresentation="Outpatient"
                            classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                            id="id_6">
                            <rim:Slot name="codingScheme">
                                <rim:ValueList>
                                    <rim:Value>Connect-a-thon healthcareFacilityTypeCodes</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Name>
                                <rim:LocalizedString value="Outpatient"/>
                            </rim:Name>
                        </rim:Classification>
                        <rim:Classification classifiedObject="Document01"
                            nodeRepresentation="General Medicine"
                            classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                            id="id_7">
                            <rim:Slot name="codingScheme">
                                <rim:ValueList>
                                    <rim:Value>Connect-a-thon practiceSettingCodes</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Name>
                                <rim:LocalizedString value="General Medicine"/>
                            </rim:Name>
                        </rim:Classification>
                        <rim:Classification classifiedObject="Document01"
                            nodeRepresentation="XTHM-WD TYPECODE"
                            classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                            id="id_8">
                            <rim:Slot name="codingScheme">
                                <rim:ValueList>
                                    <rim:Value>1.3.6.1.4.1.21367.100.1</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Name>
                                <rim:LocalizedString value="XTHM-WD TYPECODE"/>
                            </rim:Name>
                        </rim:Classification>
                        <rim:ExternalIdentifier
                            value="SR7^^^&amp;1.2.260&amp;ISO"
                            identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                            id="id_9" registryObject="Document01">
                            <rim:Name>
                                <rim:LocalizedString value="XDSDocumentEntry.patientId"/>
                            </rim:Name>
                        </rim:ExternalIdentifier>
                        <rim:ExternalIdentifier value="1.42.20160705093311.6"
                            identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                            id="id_10" registryObject="Document01">
                            <rim:Name>
                                <rim:LocalizedString value="XDSDocumentEntry.uniqueId"/>
                            </rim:Name>
                        </rim:ExternalIdentifier>
                    </rim:ExtrinsicObject>
                    <rim:RegistryPackage id="SubmissionSet01"
                        objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
                        <rim:Slot name="submissionTime">
                            <rim:ValueList>
                                <rim:Value>20041225235050</rim:Value>
                            </rim:ValueList>
                        </rim:Slot>
                        <rim:Name>
                            <rim:LocalizedString value="Physical"/>
                        </rim:Name>
                        <rim:Description>
                            <rim:LocalizedString value="Annual physical"/>
                        </rim:Description>
                        <rim:Classification classifiedObject="SubmissionSet01" nodeRepresentation=""
                            classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                            id="id_11">
                            <rim:Slot name="authorPerson">
                                <rim:ValueList>
                                    <rim:Value>^Dopplemeyer^Sherry^^^</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Slot name="authorInstitution">
                                <rim:ValueList>
                                    <rim:Value>Cleveland Clinic</rim:Value>
                                    <rim:Value>Berea Community</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Slot name="authorRole">
                                <rim:ValueList>
                                    <rim:Value>Primary Surgon</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Slot name="authorSpecialty">
                                <rim:ValueList>
                                    <rim:Value>Orthopedic</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                        </rim:Classification>
                        <rim:Classification classifiedObject="SubmissionSet01"
                            nodeRepresentation="34133-9"
                            classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                            id="id_12">
                            <rim:Slot name="codingScheme">
                                <rim:ValueList>
                                    <rim:Value>2.16.840.1.113883.6.1</rim:Value>
                                </rim:ValueList>
                            </rim:Slot>
                            <rim:Name>
                                <rim:LocalizedString value="Summary of Episode Note"/>
                            </rim:Name>
                        </rim:Classification>
                        <rim:ExternalIdentifier value="1.42.20160705093311.7"
                            identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                            id="id_13" registryObject="SubmissionSet01">
                            <rim:Name>
                                <rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
                            </rim:Name>
                        </rim:ExternalIdentifier>
                        <rim:ExternalIdentifier value="1.3.6.1.4.1.21367.4"
                            identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                            id="id_14" registryObject="SubmissionSet01">
                            <rim:Name>
                                <rim:LocalizedString value="XDSSubmissionSet.sourceId"/>
                            </rim:Name>
                        </rim:ExternalIdentifier>
                        <rim:ExternalIdentifier
                            value="SR7^^^&amp;1.2.260&amp;ISO"
                            identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446"
                            objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                            id="id_15" registryObject="SubmissionSet01">
                            <rim:Name>
                                <rim:LocalizedString value="XDSSubmissionSet.patientId"/>
                            </rim:Name>
                        </rim:ExternalIdentifier>
                    </rim:RegistryPackage>
                    <rim:Classification classifiedObject="SubmissionSet01"
                        classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd"
                        id="ID_371617681_1"
                        objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"/>
                    <rim:Association targetObject="Document01" sourceObject="SubmissionSet01"
                        associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember"
                        id="ID_371617681_2"
                        objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Association">
                        <rim:Slot name="SubmissionSetStatus">
                            <rim:ValueList>
                                <rim:Value>Original</rim:Value>
                            </rim:ValueList>
                        </rim:Slot>
                    </rim:Association>
                </rim:RegistryObjectList>
            </lcm:SubmitObjectsRequest>
            <xdsb:Document id="Document01">
                <xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include"
                    href="cid:1.b5b57d7287e4fa4b528a8f050c41f8ad829c20332f23b48d@apache.org"/>
            </xdsb:Document>
        </xdsb:ProvideAndRegisterDocumentSetRequest>
    </soapenv:Body>
</soapenv:Envelope>

--MIMEBoundary_95b57d7287e4fa4b528a8f050c41f8ad829c20332f23b48d
Content-Type: text/plain
Content-Transfer-Encoding: binary
Content-ID: <1.b5b57d7287e4fa4b528a8f050c41f8ad829c20332f23b48d@apache.org>

This is my document.

It is great!


--MIMEBoundary_95b57d7287e4fa4b528a8f050c41f8ad829c20332f23b48d--

